app/views/client_records/edit.html.erb

              <option value="">選択してください</option>
              <% Client.all.each do |c| %>
---
SELECT "clients".* FROM "clients"