app/views/client_records/index.html.erb

        <td><%= record.visited_at&.strftime('%Y/%m/%d %H:%M') %></td>
        <td><%= record.client&.last_name.to_s + record.client&.first_name.to_s %></td>
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (6, 18, 16, 3, 10, 5, 1, 11, 4, 14, 21, 23, 26, 19, 22)