app/views/client_records/new.html.erb

SELECT "clients".* FROM "clients"
---
              <% @clients.each do |c| %>
                <option value="<%= c.id %>" <%= 'selected' if defined?(@client_record) && c.id == @client_record.client_id %>><%= c.last_name + c.first_name %></option>