app/views/client_records/show.html.erb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 18 LIMIT 1
---
    <table class="client-detail-table">
      <tr><th>顧客</th><td><%= @client_record.client&.last_name.to_s + @client_record.client&.first_name.to_s %></td></tr>