app/controllers/client_records_controller.rb

  def create
    # Ensure the client belongs to current_user. If client_id is missing, let validation return 422.
    client_id = params.dig(:client_record, :client_id)
    @client_record = ClientRecord.new(client_record_params)
    if client_id.present?
      if Client.exists?(id: client_id)
        client = current_user.clients.find_by(id: client_id)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 6 LIMIT 1