app/controllers/client_records_controller.rb

  def index
    @client_records = ClientRecord.includes(:client)
    if params[:q].present?
      q = params[:q].strip
      @client_records = @client_records.joins(:client).where("CONCAT(clients.last_name, clients.first_name) LIKE ?", "%#{q}%")
    end
    case params[:sort]
    when "visited_at_asc"
      @client_records = @client_records.order(visited_at: :asc)
    when "visited_at_desc"
      @client_records = @client_records.order(visited_at: :desc)
    when "amount_asc"
      @client_records = @client_records.order(amount: :asc)
    when "amount_desc"
      @client_records = @client_records.order(amount: :desc)
    else
      @client_records = @client_records.order(visited_at: :desc)
    end
    @client_records = @client_records.page(params[:page]).per(20)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (18, 16, 3, 6, 10, 5, 1, 11, 4, 14, 21, 23, 26, 19, 22, 30)
SELECT "client_records".* FROM "client_records" ORDER BY "client_records"."visited_at" DESC LIMIT 20 OFFSET 0
SELECT "client_records".* FROM "client_records" ORDER BY "client_records"."amount" DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "client_records"

  def show
    @client_record = ClientRecord.find(params[:id])
---
SELECT "client_records".* FROM "client_records" WHERE "client_records"."id" = 94 LIMIT 1

  def edit
    @client_record = ClientRecord.find(params[:id])
---
SELECT "client_records".* FROM "client_records" WHERE "client_records"."id" = 94 LIMIT 1

  def create
    @client_record = ClientRecord.new(client_record_params)
    if @client_record.save
---
INSERT INTO "client_records" ("client_id", "visited_at", "note", "amount", "created_at", "updated_at") VALUES (6, '2025-08-31 23:41:00', 'fkpasdojfosjfosajfiojdasofgjdsiajfiodsajfidsjfidsahfiodpshjfiopdsajfiodjsfosajfiodsjfiosajfoidsajfiodsjfiosdajfoidsajfiods', 50000, '2025-08-31 14:41:52.545190', '2025-08-31 14:41:52.545190') RETURNING "id"

  def update
    @client_record = ClientRecord.find(params[:id])
    if @client_record.update(client_record_params)
---
SELECT "client_records".* FROM "client_records" WHERE "client_records"."id" = 37 LIMIT 1
UPDATE "client_records" SET "note" = 'fkpasdojfosjfosajfiojdasofgjdsiajfiodsajfidsjfidsahfiodpshjfiopdsajfiodjsfosajfiodsjfiosajfoidsajfiodsjfiosdajfoidsajfiodsaaa', "updated_at" = '2025-09-03 15:25:10.653243' WHERE "client_records"."id" = 94