app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE (CONCAT(last_name, first_name) LIKE '%佐藤%') ORDER BY "clients"."id" ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "clients"
SELECT "clients"."id" FROM "clients" ORDER BY "clients"."id" ASC LIMIT 20 OFFSET 0
---
  def index
    @clients = Client.all
    if params[:q].present?
      q = params[:q].strip
      @clients = @clients.where("CONCAT(last_name, first_name) LIKE ?", "%#{q}%")
    end
    @clients = @clients.order(:id).page(params[:page]).per(20)

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
---
  def show
    @client = Client.find(params[:id])

INSERT INTO "clients" ("user_id", "birthday", "first_name", "last_name", "postal_code", "address", "phone_number", "memo", "email", "created_at", "updated_at") VALUES (4, '2025-08-07', 'かいしゅう', 'かつ', '9810011', 'せんだい', '0000000', 'fdasfsafafsa', 'testt@example.com', '2025-08-31 14:17:16.650496', '2025-08-31 14:17:16.650496') RETURNING "id"
---
  def create
    @client = Client.new(client_params)
    @client.user_id = current_user.id
    if @client.save

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
---
  def edit
    @client = Client.find(params[:id])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
UPDATE "clients" SET "memo" = 'メモ2', "updated_at" = '2025-08-31 14:20:28.663709' WHERE "clients"."id" = 1
---
  def update
    @client = Client.find(params[:id])
    if @client.update(client_params)