app/controllers/client_records_controller.rb

  def client_records
    @client_records ||= ClientRecord.joins(:client).where(clients: { user_id: current_user.id })
---
SELECT "client_records".* FROM "client_records" INNER JOIN "clients" ON "clients"."id" = "client_records"."client_id" WHERE "clients"."user_id" = 4 AND "client_records"."id" = 94 LIMIT 1