app/controllers/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'test@exmaple.com' ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    self.resource = User.find_for_database_authentication(email: params.dig(:user, :email))